8evgeny/GIT/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/LCD_Example/MLDR187.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>DMA description</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STATUS</name>
          <displayName>STATUS</displayName>
          <description>STATUS description</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEST_STATUS</name>
              <description>TEST_STATUS description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHNLS_MINUS1</name>
              <description>CHNLS_MINUS1 description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE</name>
              <description>STATE description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASTER_ENABLE</name>
              <description>MASTER_ENABLE description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <displayName>CFG</displayName>
          <description>CFG description</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHNL_PROT_CTRL</name>
              <description>CHNL_PROT_CTRL description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MASTER_ENABLE</name>
              <description>MASTER_ENABLE description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_BASE_PTR</name>
          <displayName>CTRL_BASE_PTR</displayName>
          <description>CTRL_BASE_PTR description</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CTRL_BASE_PTR</name>
              <description>CTRL_BASE_PTR description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>22</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALT_CTRL_BASE_PTR</name>
          <displayName>ALT_CTRL_BASE_PTR</displayName>
          <description>ALT_CTRL_BASE_PTR description</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>WAITONREQ_STATUS</name>
          <displayName>WAITONREQ_STATUS</displayName>
          <description>WAITONREQ_STATUS description</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DMA_WAITONREQ_0</name>
              <description>DMA_WAITONREQ_0 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_1</name>
              <description>DMA_WAITONREQ_1 description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_2</name>
              <description>DMA_WAITONREQ_2 description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_3</name>
              <description>DMA_WAITONREQ_3 description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_4</name>
              <description>DMA_WAITONREQ_4 description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_5</name>
              <description>DMA_WAITONREQ_5 description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_6</name>
              <description>DMA_WAITONREQ_6 description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_7</name>
              <description>DMA_WAITONREQ_7 description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_8</name>
              <description>DMA_WAITONREQ_8 description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_9</name>
              <description>DMA_WAITONREQ_9 description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_10</name>
              <description>DMA_WAITONREQ_10 description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_11</name>
              <description>DMA_WAITONREQ_11 description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_12</name>
              <description>DMA_WAITONREQ_12 description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_13</name>
              <description>DMA_WAITONREQ_13 description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_14</name>
              <description>DMA_WAITONREQ_14 description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_15</name>
              <description>DMA_WAITONREQ_15 description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_16</name>
              <description>DMA_WAITONREQ_16 description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_17</name>
              <description>DMA_WAITONREQ_17 description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_18</name>
              <description>DMA_WAITONREQ_18 description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_19</name>
              <description>DMA_WAITONREQ_19 description</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_20</name>
              <description>DMA_WAITONREQ_20 description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_21</name>
              <description>DMA_WAITONREQ_21 description</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_22</name>
              <description>DMA_WAITONREQ_22 description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_23</name>
              <description>DMA_WAITONREQ_23 description</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_24</name>
              <description>DMA_WAITONREQ_24 description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_25</name>
              <description>DMA_WAITONREQ_25 description</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_26</name>
              <description>DMA_WAITONREQ_26 description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_27</name>
              <description>DMA_WAITONREQ_27 description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_28</name>
              <description>DMA_WAITONREQ_28 description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_29</name>
              <description>DMA_WAITONREQ_29 description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_30</name>
              <description>DMA_WAITONREQ_30 description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_WAITONREQ_31</name>
              <description>DMA_WAITONREQ_31 description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL_SW_REQUEST</name>
          <displayName>CHNL_SW_REQUEST</displayName>
          <description>CHNL_SW_REQUEST description</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHNL_SW_REQUEST_0</name>
              <description>CHNL_SW_REQUEST_0 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_1</name>
              <description>CHNL_SW_REQUEST_1 description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_2</name>
              <description>CHNL_SW_REQUEST_2 description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_3</name>
              <description>CHNL_SW_REQUEST_3 description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_4</name>
              <description>CHNL_SW_REQUEST_4 description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_5</name>
              <description>CHNL_SW_REQUEST_5 description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_6</name>
              <description>CHNL_SW_REQUEST_6 description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_7</name>
              <description>CHNL_SW_REQUEST_7 description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_8</name>
              <description>CHNL_SW_REQUEST_8 description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_9</name>
              <description>CHNL_SW_REQUEST_9 description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_10</name>
              <description>CHNL_SW_REQUEST_10 description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_11</name>
              <description>CHNL_SW_REQUEST_11 description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_12</name>
              <description>CHNL_SW_REQUEST_12 description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_13</name>
              <description>CHNL_SW_REQUEST_13 description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_14</name>
              <description>CHNL_SW_REQUEST_14 description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_15</name>
              <description>CHNL_SW_REQUEST_15 description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_16</name>
              <description>CHNL_SW_REQUEST_16 description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_17</name>
              <description>CHNL_SW_REQUEST_17 description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_18</name>
              <description>CHNL_SW_REQUEST_18 description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_19</name>
              <description>CHNL_SW_REQUEST_19 description</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_20</name>
              <description>CHNL_SW_REQUEST_20 description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_21</name>
              <description>CHNL_SW_REQUEST_21 description</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_22</name>
              <description>CHNL_SW_REQUEST_22 description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_23</name>
              <description>CHNL_SW_REQUEST_23 description</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_24</name>
              <description>CHNL_SW_REQUEST_24 description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_25</name>
              <description>CHNL_SW_REQUEST_25 description</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_26</name>
              <description>CHNL_SW_REQUEST_26 description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_27</name>
              <description>CHNL_SW_REQUEST_27 description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_28</name>
              <description>CHNL_SW_REQUEST_28 description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_29</name>
              <description>CHNL_SW_REQUEST_29 description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_30</name>
              <description>CHNL_SW_REQUEST_30 description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL_SW_REQUEST_31</name>
              <description>CHNL_SW_REQUEST_31 description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
