8evgeny/GIT/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/LCD_Example/MLDR187.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>ADC description</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40040000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADC1_CFG</name>
          <displayName>ADC1_CFG</displayName>
          <description>ADC1_CFG description</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REG_ADON</name>
              <description>REG_ADON description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REG_GO</name>
              <description>REG_GO description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REG_CLKS</name>
              <description>REG_CLKS description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REG_SAMPLE</name>
              <description>REG_SAMPLE description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REG_CHS</name>
              <description>REG_CHS description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>REG_CHCH</name>
              <description>REG_CHCH description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REG_RNGC</name>
              <description>REG_RNGC description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M_REF</name>
              <description>M_REF description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REG_DIVCLK</name>
              <description>REG_DIVCLK description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EN_NOISE_RNG</name>
              <description>EN_NOISE_RNG description</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Delay_Go</name>
              <description>Delay_Go description</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1_H_LEVEL</name>
          <displayName>ADC1_H_LEVEL</displayName>
          <description>ADC1_H_LEVEL description</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REG_H_LEVEL</name>
              <description>REG_H_LEVEL description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1_L_LEVEL</name>
          <displayName>ADC1_L_LEVEL</displayName>
          <description>ADC1_L_LEVEL description</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REG_L_LEVEL</name>
              <description>REG_L_LEVEL description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1_RESULT</name>
          <displayName>ADC1_RESULT</displayName>
          <description>ADC1_RESULT description</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>RESULT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CHANNEL</name>
              <description>CHANNEL description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1_STATUS</name>
          <displayName>ADC1_STATUS</displayName>
          <description>ADC1_STATUS description</description>
          <addressOffset>0x00000020</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>Flg_REG_OVERWRITE</name>
              <description>Flg_REG_OVERWRITE description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Flg_REG_AWOIFEN</name>
              <description>Flg_REG_AWOIFEN description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Flg_REG_EOCIF</name>
              <description>Flg_REG_EOCIF description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWOIF_IE</name>
              <description>AWOIF_IE description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECOIF_IE</name>
              <description>ECOIF_IE description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1_CHSEL</name>
          <displayName>ADC1_CHSEL</displayName>
          <description>ADC1_CHSEL description</description>
          <addressOffset>0x00000028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>Sl_Ch_Ch_REF0</name>
              <description>Sl_Ch_Ch_REF0 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Sl_Ch_Ch_REF1</name>
              <description>Sl_Ch_Ch_REF1 description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Sl_Ch_Ch_REF2</name>
              <description>Sl_Ch_Ch_REF2 description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Sl_Ch_Ch_REF3</name>
              <description>Sl_Ch_Ch_REF3 description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Sl_Ch_Ch_REF4</name>
              <description>Sl_Ch_Ch_REF4 description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Sl_Ch_Ch_REF5</name>
              <description>Sl_Ch_Ch_REF5 description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Sl_Ch_Ch_REF6</name>
              <description>Sl_Ch_Ch_REF6 description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Sl_Ch_Ch_REF7</name>
              <description>Sl_Ch_Ch_REF7 description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1_TRIM</name>
          <displayName>ADC1_TRIM</displayName>
          <description>ADC1_TRIM description</description>
          <addressOffset>0x00000030</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BG_TRIM</name>
              <description>BG_TRIM description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
