8evgeny/GIT/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/LCD_Example/MLDR187.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADCUI</name>
      <description>ADCUI description</description>
      <groupName>ADCUI</groupName>
      <baseAddress>0x40068000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL1</name>
          <displayName>CTRL1</displayName>
          <description>CTRL1 description</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OSR_CONF</name>
              <description>OSR_CONF description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>tst_in_4</name>
              <description>tst_in_4 description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESET_DIG</name>
              <description>RESET_DIG description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ZXRMS</name>
              <description>ZXRMS description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>tst_in_3_2</name>
              <description>tst_in_3_2 description</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>tst_in_1</name>
              <description>tst_in_1 description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>tst_in_0</name>
              <description>tst_in_0 description</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREF_SEL</name>
              <description>VREF_SEL description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FREQSEL</name>
              <description>FREQSEL description</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VANOLOAD</name>
              <description>VANOLOAD description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VARNOLOAD</name>
              <description>VARNOLOAD description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>APNOLOAD</name>
              <description>APNOLOAD description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PER_LENGTH</name>
              <description>PER_LENGTH description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ZXLPF</name>
              <description>ZXLPF description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESOL</name>
              <description>RESOL description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I3EN</name>
              <description>I3EN description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>V2EN</name>
              <description>V2EN description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2EN</name>
              <description>I2EN description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>V1EN</name>
              <description>V1EN description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I1EN</name>
              <description>I1EN description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>V0EN</name>
              <description>V0EN description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I0EN</name>
              <description>I0EN description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <displayName>CTRL2</displayName>
          <description>CTRL2 description</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAGCYC</name>
              <description>SAGCYC description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SAGLVL</name>
              <description>SAGLVL description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL3</name>
          <displayName>CTRL3</displayName>
          <description>CTRL3 description</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ZXTOUT</name>
              <description>ZXTOUT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F0CTR</name>
          <displayName>F0CTR</displayName>
          <description>F0CTR description</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0IRMSOS</name>
              <description>F0IRMSOS description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>F0I3GAIN</name>
              <description>F0I3GAIN description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F0VPHASE</name>
              <description>F0VPHASE description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>F0VGAIN</name>
              <description>F0VGAIN description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F0IGAIN</name>
              <description>F0IGAIN description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F0RVRS</name>
              <description>F0RVRS description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>F0RRRS</name>
              <description>F0RRRS description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>F0RARS</name>
              <description>F0RARS description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>F0VASEL</name>
              <description>F0VASEL description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0I3NTEN</name>
              <description>F0I3NTEN description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0I0NTEN</name>
              <description>F0I0NTEN description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F0WC</name>
          <displayName>F0WC</displayName>
          <description>F0WC description</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0WGAIN</name>
              <description>F0WGAIN description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>F0WATTOS</name>
              <description>F0WATTOS description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F0WATTP</name>
          <displayName>F0WATTP</displayName>
          <description>F0WATTP description</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F0WATTN</name>
          <displayName>F0WATTN</displayName>
          <description>F0WATTN description</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F0VC</name>
          <displayName>F0VC</displayName>
          <description>F0VC description</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0VARGAIN</name>
              <description>F0VARGAIN description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>F0VAROS</name>
              <description>F0VAROS description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F0VARP</name>
          <displayName>F0VARP</displayName>
          <description>F0VARP description</description>
          <addressOffset>0x00000020</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F0VARN</name>
          <displayName>F0VARN</displayName>
          <description>F0VARN description</description>
          <addressOffset>0x00000024</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F0AC</name>
          <displayName>F0AC</displayName>
          <description>F0AC description</description>
          <addressOffset>0x00000028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0VAGAIN</name>
              <description>F0VAGAIN description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>F0I3SEL</name>
              <description>F0I3SEL description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0VRMSOS</name>
              <description>F0VRMSOS description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F0VR</name>
          <displayName>F0VR</displayName>
          <description>F0VR description</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F0MD0</name>
          <displayName>F0MD0</displayName>
          <description>F0MD0 description</description>
          <addressOffset>0x00000030</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0SEL_I_CH</name>
              <description>F0SEL_I_CH description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F0PER_FREQ</name>
              <description>F0PER_FREQ description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I3GAIN</name>
              <description>I3GAIN description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>V0GAIN</name>
              <description>V0GAIN description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I0GAIN</name>
              <description>I0GAIN description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0REACTS</name>
              <description>F0REACTS description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F0ACTS</name>
              <description>F0ACTS description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F0ISEL</name>
              <description>F0ISEL description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F0VSEL</name>
              <description>F0VSEL description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F0MD1</name>
          <displayName>F0MD1</displayName>
          <description>F0MD1 description</description>
          <addressOffset>0x00000034</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0VPKLVL</name>
              <description>F0VPKLVL description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>F0IPKLVL</name>
              <description>F0IPKLVL description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F0VPEAK</name>
          <displayName>F0VPEAK</displayName>
          <description>F0VPEAK description</description>
          <addressOffset>0x00000038</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0VPEAK</name>
              <description>F0VPEAK description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F0IPEAK</name>
          <displayName>F0IPEAK</displayName>
          <description>F0IPEAK description</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0IPEAK</name>
              <description>F0IPEAK description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F0VDAT</name>
          <displayName>F0VDAT</displayName>
          <description>F0VDAT description</description>
          <addressOffset>0x00000040</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0VDAT</name>
              <description>F0VDAT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F0I0DAT</name>
          <displayName>F0I0DAT</displayName>
          <description>F0I0DAT description</description>
          <addressOffset>0x00000044</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0I0DAT</name>
              <description>F0I0DAT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F0I3DAT</name>
          <displayName>F0I3DAT</displayName>
          <description>F0I3DAT description</description>
          <addressOffset>0x00000048</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0I3DAT</name>
              <description>F0I3DAT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F0VRMS</name>
          <displayName>F0VRMS</displayName>
          <description>F0VRMS description</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0VRMS</name>
              <description>F0VRMS description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F0VRMS2</name>
          <displayName>F0VRMS2</displayName>
          <description>F0VRMS2 description</description>
          <addressOffset>0x00000050</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F0IRMS</name>
          <displayName>F0IRMS</displayName>
          <description>F0IRMS description</description>
          <addressOffset>0x00000054</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0IRMS</name>
              <description>F0IRMS description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F0IRMS2</name>
          <displayName>F0IRMS2</displayName>
          <description>F0IRMS2 description</description>
          <addressOffset>0x00000058</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
