8evgeny/GIT/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/LCD_Example/MLDR187.svd
        <register>
          <name>F0STAT</name>
          <displayName>F0STAT</displayName>
          <description>F0STAT description</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0VAROVN</name>
              <description>F0VAROVN description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0WATTOVN</name>
              <description>F0WATTOVN description</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C3IF_OVR</name>
              <description>C3IF_OVR description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C3IF_FLL</name>
              <description>C3IF_FLL description</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>C3IF_EMP</name>
              <description>C3IF_EMP description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F0ZEROCRS</name>
              <description>F0ZEROCRS description</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0VANLDFL</name>
              <description>F0VANLDFL description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F0VARNLDFL</name>
              <description>F0VARNLDFL description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F0VARSIGN</name>
              <description>F0VARSIGN description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0APNLDFL</name>
              <description>F0APNLDFL description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F0APSIGN</name>
              <description>F0APSIGN description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0FAULTCON</name>
              <description>F0FAULTCON description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0ICHANNEL</name>
              <description>F0ICHANNEL description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F0ZXTOF</name>
              <description>F0ZXTOF description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0VAOV</name>
              <description>F0VAOV description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0VAROVP</name>
              <description>F0VAROVP description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0WATTOVP</name>
              <description>F0WATTOVP description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0PEAKIF</name>
              <description>F0PEAKIF description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0PEAKVF</name>
              <description>F0PEAKVF description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0SAGF</name>
              <description>F0SAGF description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0IF_OVR</name>
              <description>F0IF_OVR description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0IF_FLL</name>
              <description>F0IF_FLL description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F0IF_EMP</name>
              <description>F0IF_EMP description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F0VF_OVR</name>
              <description>F0VF_OVR description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0VF_FLL</name>
              <description>F0VF_FLL description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F0VF_EMP</name>
              <description>F0VF_EMP description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F0MASK</name>
          <displayName>F0MASK</displayName>
          <description>F0MASK description</description>
          <addressOffset>0x00000060</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0VAROVNM</name>
              <description>F0VAROVNM description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0WATTOVNM</name>
              <description>F0WATTOVNM description</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C3IF_OVRM</name>
              <description>C3IF_OVRM description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C3IF_FLLM</name>
              <description>C3IF_FLLM description</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C3IF_EMPM</name>
              <description>C3IF_EMPM description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0ZEROCRSM</name>
              <description>F0ZEROCRSM description</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0VANLDFLM</name>
              <description>F0VANLDFLM description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0VARNLDFLM</name>
              <description>F0VARNLDFLM description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0VARSIGNM</name>
              <description>F0VARSIGNM description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0APNLDFLM</name>
              <description>F0APNLDFLM description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0APSIGNM</name>
              <description>F0APSIGNM description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0FAULTCONM</name>
              <description>F0FAULTCONM description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0ZXTOFM</name>
              <description>F0ZXTOFM description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0VAOVM</name>
              <description>F0VAOVM description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0VAROVPM</name>
              <description>F0VAROVPM description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0WATTOVPM</name>
              <description>F0WATTOVPM description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0PEAKIFM</name>
              <description>F0PEAKIFM description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0PEAKVFM</name>
              <description>F0PEAKVFM description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0SAGFM</name>
              <description>F0SAGFM description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0IF_OVRM</name>
              <description>F0IF_OVRM description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0IF_FLLM</name>
              <description>F0IF_FLLM description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F0IF_EMPM</name>
              <description>F0IF_EMPM description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F0VF_OVRM</name>
              <description>F0VF_OVRM description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F0VF_FLLM</name>
              <description>F0VF_FLLM description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F0VF_EMPM</name>
              <description>F0VF_EMPM description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F1CTR</name>
          <displayName>F1CTR</displayName>
          <description>F1CTR description</description>
          <addressOffset>0x00000064</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1IRMSOS</name>
              <description>F1IRMSOS description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>F1VPHASE</name>
              <description>F1VPHASE description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>F1VGAIN</name>
              <description>F1VGAIN description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F1IGAIN</name>
              <description>F1IGAIN description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F1RVRS</name>
              <description>F1RVRS description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>F1RRRS</name>
              <description>F1RRRS description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>F1RARS</name>
              <description>F1RARS description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>F1VASEL</name>
              <description>F1VASEL description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1INTEN</name>
              <description>F1INTEN description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F1WC</name>
          <displayName>F1WC</displayName>
          <description>F1WC description</description>
          <addressOffset>0x00000068</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1WGAIN</name>
              <description>F1WGAIN description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>F1WATTOS</name>
              <description>F1WATTOS description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F1WATTP</name>
          <displayName>F1WATTP</displayName>
          <description>F1WATTP description</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F1WATTN</name>
          <displayName>F1WATTN</displayName>
          <description>F1WATTN description</description>
          <addressOffset>0x00000070</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F1VC</name>
          <displayName>F1VC</displayName>
          <description>F1VC description</description>
          <addressOffset>0x00000074</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1VARGAIN</name>
              <description>F1VARGAIN description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>F1VAROS</name>
              <description>F1VAROS description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F1VARP</name>
          <displayName>F1VARP</displayName>
          <description>F1VARP description</description>
          <addressOffset>0x00000078</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F1VARN</name>
          <displayName>F1VARN</displayName>
          <description>F1VARN description</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F1AC</name>
          <displayName>F1AC</displayName>
          <description>F1AC description</description>
          <addressOffset>0x00000080</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1VAGAIN</name>
              <description>F1VAGAIN description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>F1VRMSOS</name>
              <description>F1VRMSOS description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F1VR</name>
          <displayName>F1VR</displayName>
          <description>F1VR description</description>
          <addressOffset>0x00000084</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F1MD0</name>
          <displayName>F1MD0</displayName>
          <description>F1MD0 description</description>
          <addressOffset>0x00000088</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1PER_FREQ</name>
              <description>F1PER_FREQ description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>V1GAIN</name>
              <description>V1GAIN description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I1GAIN</name>
              <description>I1GAIN description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1REACTS</name>
              <description>F1REACTS description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F1ACTS</name>
              <description>F1ACTS description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F1ISEL</name>
              <description>F1ISEL description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F1VSEL</name>
              <description>F1VSEL description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F1MD1</name>
          <displayName>F1MD1</displayName>
          <description>F1MD1 description</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1VPKLVL</name>
              <description>F1VPKLVL description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>F1IPKLVL</name>
              <description>F1IPKLVL description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F1MD2</name>
          <displayName>F1MD2</displayName>
          <description>F1MD2 description</description>
          <addressOffset>0x00000090</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1PHASE</name>
              <description>F1PHASE description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F1VPEAK</name>
          <displayName>F1VPEAK</displayName>
          <description>F1VPEAK description</description>
          <addressOffset>0x00000094</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1VPEAK</name>
              <description>F1VPEAK description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F1IPEAK</name>
          <displayName>F1IPEAK</displayName>
          <description>F1IPEAK description</description>
          <addressOffset>0x00000098</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1IPEAK</name>
              <description>F1IPEAK description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
