8evgeny/GIT/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/LCD_Example/MLDR187.svd
        <register>
          <name>F1VDAT</name>
          <displayName>F1VDAT</displayName>
          <description>F1VDAT description</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1VDAT</name>
              <description>F1VDAT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F1IDAT</name>
          <displayName>F1IDAT</displayName>
          <description>F1IDAT description</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1IDAT</name>
              <description>F1IDAT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F1VRMS</name>
          <displayName>F1VRMS</displayName>
          <description>F1VRMS description</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1VRMS</name>
              <description>F1VRMS description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F1VRMS2</name>
          <displayName>F1VRMS2</displayName>
          <description>F1VRMS2 description</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F1IRMS</name>
          <displayName>F1IRMS</displayName>
          <description>F1IRMS description</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1IRMS</name>
              <description>F1IRMS description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F1IRMS2</name>
          <displayName>F1IRMS2</displayName>
          <description>F1IRMS2 description</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F1STAT</name>
          <displayName>F1STAT</displayName>
          <description>F1STAT description</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1VAROVN</name>
              <description>F1VAROVN description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1WATTOVN</name>
              <description>F1WATTOVN description</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1ZEROCRS</name>
              <description>F1ZEROCRS description</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1VANLDFL</name>
              <description>F1VANLDFL description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F1VARNLDFL</name>
              <description>F1VARNLDFL description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F1VARSIGN</name>
              <description>F1VARSIGN description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1APNLDFL</name>
              <description>F1APNLDFL description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F1APSIGN</name>
              <description>F1APSIGN description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1ZXTOF</name>
              <description>F1ZXTOF description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1VAOV</name>
              <description>F1VAOV description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1VAROVP</name>
              <description>F1VAROVP description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1WATTOVP</name>
              <description>F1WATTOVP description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1PEAKIF</name>
              <description>F1PEAKIF description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1PEAKVF</name>
              <description>F1PEAKVF description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1SAGF</name>
              <description>F1SAGF description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1IF_OVR</name>
              <description>F1IF_OVR description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1IF_FLL</name>
              <description>F1IF_FLL description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F1IF_EMP</name>
              <description>F1IF_EMP description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F1VF_OVR</name>
              <description>F1VF_OVR description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1VF_FLL</name>
              <description>F1VF_FLL description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F1VF_EMP</name>
              <description>F1VF_EMP description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F1MASK</name>
          <displayName>F1MASK</displayName>
          <description>F1MASK description</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1VAROVNM</name>
              <description>F1VAROVNM description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1WATTOVNM</name>
              <description>F1WATTOVNM description</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1ZEROCRSM</name>
              <description>F1ZEROCRSM description</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1VANLDFLM</name>
              <description>F1VANLDFLM description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1VARNLDFLM</name>
              <description>F1VARNLDFLM description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1VARSIGNM</name>
              <description>F1VARSIGNM description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1APNLDFLM</name>
              <description>F1APNLDFLM description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1APSIGNM</name>
              <description>F1APSIGNM description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1ZXTOFM</name>
              <description>F1ZXTOFM description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1VAOVM</name>
              <description>F1VAOVM description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1VAROVPM</name>
              <description>F1VAROVPM description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1WATTOVPM</name>
              <description>F1WATTOVPM description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1PEAKIFM</name>
              <description>F1PEAKIFM description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1PEAKVFM</name>
              <description>F1PEAKVFM description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1SAGFM</name>
              <description>F1SAGFM description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1IF_OVRM</name>
              <description>F1IF_OVRM description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1IF_FLLM</name>
              <description>F1IF_FLLM description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1IF_EMPM</name>
              <description>F1IF_EMPM description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1VF_OVRM</name>
              <description>F1VF_OVRM description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1VF_FLLM</name>
              <description>F1VF_FLLM description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F1VF_EMPM</name>
              <description>F1VF_EMPM description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F2CTR</name>
          <displayName>F2CTR</displayName>
          <description>F2CTR description</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F2IRMSOS</name>
              <description>F2IRMSOS description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>F2VPHASE</name>
              <description>F2VPHASE description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>F2VGAIN</name>
              <description>F2VGAIN description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F2IGAIN</name>
              <description>F2IGAIN description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F2RVRS</name>
              <description>F2RVRS description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>F2RRRS</name>
              <description>F2RRRS description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>F2RARS</name>
              <description>F2RARS description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>F2VASEL</name>
              <description>F2VASEL description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F2INTEN</name>
              <description>F2INTEN description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F2WC</name>
          <displayName>F2WC</displayName>
          <description>F2WC description</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F2WGAIN</name>
              <description>F2WGAIN description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>F2WATTOS</name>
              <description>F2WATTOS description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F2WATTP</name>
          <displayName>F2WATTP</displayName>
          <description>F2WATTP description</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F2WATTN</name>
          <displayName>F2WATTN</displayName>
          <description>F2WATTN description</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F2VC</name>
          <displayName>F2VC</displayName>
          <description>F2VC description</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F2VARGAIN</name>
              <description>F2VARGAIN description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>F2VAROS</name>
              <description>F2VAROS description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F2VARP</name>
          <displayName>F2VARP</displayName>
          <description>F2VARP description</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F2VARN</name>
          <displayName>F2VARN</displayName>
          <description>F2VARN description</description>
          <addressOffset>0x000000D4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F2AC</name>
          <displayName>F2AC</displayName>
          <description>F2AC description</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F2VAGAIN</name>
              <description>F2VAGAIN description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>F2VRMSOS</name>
              <description>F2VRMSOS description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F2VR</name>
          <displayName>F2VR</displayName>
          <description>F2VR description</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>F2MD0</name>
          <displayName>F2MD0</displayName>
          <description>F2MD0 description</description>
          <addressOffset>0x000000E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F2PER_FREQ</name>
              <description>F2PER_FREQ description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>V2GAIN</name>
              <description>V2GAIN description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2GAIN</name>
              <description>I2GAIN description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>F2REACTS</name>
              <description>F2REACTS description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F2ACTS</name>
              <description>F2ACTS description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>F2ISEL</name>
              <description>F2ISEL description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F2VSEL</name>
              <description>F2VSEL description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F2MD1</name>
          <displayName>F2MD1</displayName>
          <description>F2MD1 description</description>
          <addressOffset>0x000000E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F2VPKLVL</name>
              <description>F2VPKLVL description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>F2IPKLVL</name>
              <description>F2IPKLVL description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F2MD2</name>
          <displayName>F2MD2</displayName>
          <description>F2MD2 description</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F2PHASE</name>
              <description>F2PHASE description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>F2VPEAK</name>
          <displayName>F2VPEAK</displayName>
          <description>F2VPEAK description</description>
          <addressOffset>0x000000EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F2VPEAK</name>
              <description>F2VPEAK description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
