8evgeny/GIT/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/LCD_Example/MLDR187.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SBLOCK4</name>
      <description>SBLOCK4 description</description>
      <groupName>SBLOCK4</groupName>
      <baseAddress>0x60018000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TRM_00</name>
          <displayName>TRM_00</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_01</name>
          <displayName>TRM_01</displayName>
          <description>Transformation register 1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_02</name>
          <displayName>TRM_02</displayName>
          <description>Transformation register 2</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_03</name>
          <displayName>TRM_03</displayName>
          <description>Transformation register 3</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_04</name>
          <displayName>TRM_04</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_05</name>
          <displayName>TRM_05</displayName>
          <description>Transformation register 1</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_06</name>
          <displayName>TRM_06</displayName>
          <description>Transformation register 2</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_07</name>
          <displayName>TRM_07</displayName>
          <description>Transformation register 3</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TABLE_CHG</name>
          <displayName>TABLE_CHG</displayName>
          <description>Table change register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TABLE_VAL_0</name>
              <description>TABLE_VAL_0 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_1</name>
              <description>TABLE_VAL_1 description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_2</name>
              <description>TABLE_VAL_2 description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_3</name>
              <description>TABLE_VAL_3 description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M_SCTRL</name>
          <displayName>M_SCTRL</displayName>
          <description>Memory special control</description>
          <addressOffset>0x00000024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SBLOCK5</name>
      <description>SBLOCK5 description</description>
      <groupName>SBLOCK5</groupName>
      <baseAddress>0x6001C000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TRM_00</name>
          <displayName>TRM_00</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_01</name>
          <displayName>TRM_01</displayName>
          <description>Transformation register 1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_02</name>
          <displayName>TRM_02</displayName>
          <description>Transformation register 2</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_03</name>
          <displayName>TRM_03</displayName>
          <description>Transformation register 3</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_04</name>
          <displayName>TRM_04</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_05</name>
          <displayName>TRM_05</displayName>
          <description>Transformation register 1</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_06</name>
          <displayName>TRM_06</displayName>
          <description>Transformation register 2</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_07</name>
          <displayName>TRM_07</displayName>
          <description>Transformation register 3</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TABLE_CHG</name>
          <displayName>TABLE_CHG</displayName>
          <description>Table change register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TABLE_VAL_0</name>
              <description>TABLE_VAL_0 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_1</name>
              <description>TABLE_VAL_1 description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_2</name>
              <description>TABLE_VAL_2 description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_3</name>
              <description>TABLE_VAL_3 description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M_SCTRL</name>
          <displayName>M_SCTRL</displayName>
          <description>Memory special control</description>
          <addressOffset>0x00000024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
