8evgeny/GIT/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/LCD_Example/MLDR187.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LBLOCK</name>
      <description>LBLOCK description</description>
      <groupName>LBLOCK</groupName>
      <baseAddress>0x60004000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TRM_00</name>
          <displayName>TRM_00</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_01</name>
          <displayName>TRM_01</displayName>
          <description>Transformation register 1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_02</name>
          <displayName>TRM_02</displayName>
          <description>Transformation register 2</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_03</name>
          <displayName>TRM_03</displayName>
          <description>Transformation register 3</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TABLE_CHG_00</name>
          <displayName>TABLE_CHG_00</displayName>
          <description>Table change 0 register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TABLE_VAL_00</name>
              <description>TABLE_VAL_00 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_01</name>
              <description>TABLE_VAL_01 description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_02</name>
              <description>TABLE_VAL_02 description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_03</name>
              <description>TABLE_VAL_03 description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TABLE_CHG_01</name>
          <displayName>TABLE_CHG_01</displayName>
          <description>Table change 1 register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TABLE_VAL_10</name>
              <description>TABLE_VAL_10 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_11</name>
              <description>TABLE_VAL_11 description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_12</name>
              <description>TABLE_VAL_12 description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_13</name>
              <description>TABLE_VAL_13 description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TABLE_CHG_02</name>
          <displayName>TABLE_CHG_02</displayName>
          <description>Table change 2 register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TABLE_VAL_20</name>
              <description>TABLE_VAL_20 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_21</name>
              <description>TABLE_VAL_21 description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_22</name>
              <description>TABLE_VAL_22 description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_23</name>
              <description>TABLE_VAL_23 description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TABLE_CHG_03</name>
          <displayName>TABLE_CHG_03</displayName>
          <description>Table change 3 register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TABLE_VAL_30</name>
              <description>TABLE_VAL_30 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_31</name>
              <description>TABLE_VAL_31 description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_32</name>
              <description>TABLE_VAL_32 description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TABLE_VAL_33</name>
              <description>TABLE_VAL_33 description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP</name>
          <displayName>SETUP</displayName>
          <description>Setup register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SET_R_COUNT</name>
              <description>SET_R_COUNT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CURR_R_COUNT</name>
              <description>CURR_R_COUNT description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SET_L_DIR</name>
              <description>SET_L_DIR description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CURR_L_DIR</name>
              <description>CURR_L_DIR description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M_SCTRL</name>
          <displayName>M_SCTRL</displayName>
          <description>Memory special control</description>
          <addressOffset>0x00000024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
