8evgeny/GIT/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/LCD_Example/MLDR187.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RANDOM</name>
      <description>RANDOM description</description>
      <groupName>RANDOM</groupName>
      <baseAddress>0x400B8000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STAT_CTRL_REG</name>
          <displayName>STAT_CTRL_REG</displayName>
          <description>Status and control register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCE_EN</name>
              <description>FORCE_EN description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN_STATE</name>
              <description>EN_STATE description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>BUSY description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UNREAD_DATA</name>
              <description>UNREAD_DATA description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK</name>
              <description>MASK description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WORK_MODE</name>
              <description>WORK_MODE description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BIT_CN</name>
              <description>BIT_CN description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CTRL_REG</name>
          <displayName>INT_CTRL_REG</displayName>
          <description>Interrupt control register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT_EN</name>
              <description>INT_EN description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNREAD_DATA</name>
              <description>UNREAD_DATA description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_DIV_REG</name>
          <displayName>CLK_DIV_REG</displayName>
          <description>Clock divider</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIV</name>
              <description>DIV description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PAUSE_REG</name>
          <displayName>PAUSE_REG</displayName>
          <description>Pause register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>OUTPUT_REG</name>
          <displayName>OUTPUT_REG</displayName>
          <description>Output random</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>PAUSE_CNT_REG</name>
          <displayName>PAUSE_CNT_REG</displayName>
          <description>Pause counter</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
        <register>
          <name>TEMP_REG</name>
          <displayName>TEMP_REG</displayName>
          <description>Temp random register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields/>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CLK_MEASURE</name>
      <description>CLK_MEASURE description</description>
      <groupName>CLK_MEASURE</groupName>
      <baseAddress>0x400B0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLK_CNTR_STAT</name>
          <displayName>CLK_CNTR_STAT</displayName>
          <description>Registr nastroek i sostojanija</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY_RESET</name>
              <description>KEY_RESET description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTERRUPT</name>
              <description>INTERRUPT description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN</name>
              <description>EN description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALARM_SHIFT_RST</name>
          <displayName>ALARM_SHIFT_RST</displayName>
          <description>Registr zadanija porogovyh znachenij dlja signala sbrosa</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BASE_REG2</name>
              <description>BASE_REG2 description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>BASE_REG0</name>
              <description>BASE_REG0 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALARM_SHIFT_INT</name>
          <displayName>ALARM_SHIFT_INT</displayName>
          <description>Registr zadanija porogovyh znachenij dlja signala preryvanija</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BASE_REG3</name>
              <description>BASE_REG3 description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>BASE_REG1</name>
              <description>BASE_REG1 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALARM_PREG_0</name>
          <displayName>ALARM_PREG_0</displayName>
          <description>Registr nastrojki parametrov sbrosa schetchikov</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PREG0</name>
              <description>PREG0 description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>PREG1</name>
              <description>PREG1 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALARM_PREG_1</name>
          <displayName>ALARM_PREG_1</displayName>
          <description>Registr nastrojki parametrov sbrosa schetchikov</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PREG2</name>
              <description>PREG2 description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>PREG3</name>
              <description>PREG3 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_STAT</name>
          <displayName>CLK_STAT</displayName>
          <description>Registr maksimal'nogo znachenija SHIFT_REG kazhdogo iz kanalov</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
