8evgeny/GIT/Миландр. Standard Peripherals Library/Example_Projects/MDR32F02/Eclipse/LCD_Example/MLDR187.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SENSORS</name>
      <description>SENSORS description</description>
      <groupName>SENSORS</groupName>
      <baseAddress>0x400A8000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STATE_REG</name>
          <displayName>STATE_REG</displayName>
          <description>Registr statusa signaly s datchikov</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MESH_ACTIVE_ALARM</name>
              <description>MESH_ACTIVE_ALARM description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMFI1</name>
              <description>EMFI1 description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMFI2</name>
              <description>EMFI2 description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMFI3</name>
              <description>EMFI3 description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LIGHT</name>
              <description>LIGHT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REAL_TIME</name>
          <displayName>REAL_TIME</displayName>
          <description>Registr monitoringa sostojanija vhodov sensorov</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MESH_ACTIVE_ALARM</name>
              <description>MESH_ACTIVE_ALARM description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EMFI1</name>
              <description>EMFI1 description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EMFI2</name>
              <description>EMFI2 description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EMFI3</name>
              <description>EMFI3 description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LIGHT</name>
              <description>LIGHT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_MASK</name>
          <displayName>INT_MASK</displayName>
          <description>Registr maski zaprosa preryvanija</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MESH_ACTIVE_ALARM</name>
              <description>MESH_ACTIVE_ALARM description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMFI1</name>
              <description>EMFI1 description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMFI2</name>
              <description>EMFI2 description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMFI3</name>
              <description>EMFI3 description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LIGHT</name>
              <description>LIGHT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>K_RES_MASK</name>
          <displayName>K_RES_MASK</displayName>
          <description>Registr maski zaprosa sbrosa</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MESH_ACTIVE_ALARM</name>
              <description>MESH_ACTIVE_ALARM description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMFI1</name>
              <description>EMFI1 description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMFI2</name>
              <description>EMFI2 description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMFI3</name>
              <description>EMFI3 description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LIGHT</name>
              <description>LIGHT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <displayName>ENABLE</displayName>
          <description>Registr vkljuchenija datchikov</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MESH_ACTIVE_ALARM</name>
              <description>MESH_ACTIVE_ALARM description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMFI1</name>
              <description>EMFI1 description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMFI2</name>
              <description>EMFI2 description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMFI3</name>
              <description>EMFI3 description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LIGHT</name>
              <description>LIGHT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MESH_KEY7</name>
          <displayName>MESH_KEY7</displayName>
          <description>Registr kljucha zaszitnoj setki 0 (bity 255:224)</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>MESH_KEY6</name>
          <displayName>MESH_KEY6</displayName>
          <description>Registr kljucha zaszitnoj setki 1 (bity 223:192)</description>
          <addressOffset>0x00000020</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>MESH_KEY5</name>
          <displayName>MESH_KEY5</displayName>
          <description>Registr kljucha zaszitnoj setki 2 (bity 191:160)</description>
          <addressOffset>0x00000024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>MESH_KEY4</name>
          <displayName>MESH_KEY4</displayName>
          <description>Registr kljucha zaszitnoj setki 3 (bity 159:128)</description>
          <addressOffset>0x00000028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>MESH_KEY3</name>
          <displayName>MESH_KEY3</displayName>
          <description>Registr kljucha zaszitnoj setki 4 (bity 127:96)</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>MESH_KEY2</name>
          <displayName>MESH_KEY2</displayName>
          <description>Registr kljucha zaszitnoj setki 5 (bity 95:64)</description>
          <addressOffset>0x00000030</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>MESH_KEY1</name>
          <displayName>MESH_KEY1</displayName>
          <description>Registr kljucha zaszitnoj setki 6 (bity 63:32)</description>
          <addressOffset>0x00000034</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>MESH_KEY0</name>
          <displayName>MESH_KEY0</displayName>
          <description>Registr kljucha zaszitnoj setki 7 (bity 31:0)</description>
          <addressOffset>0x00000038</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>MESH_INIT1</name>
          <displayName>MESH_INIT1</displayName>
          <description>Registr inicializacii dannyh zaszitnoj setki 0 (bity 63:32)</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>MESH_INIT0</name>
          <displayName>MESH_INIT0</displayName>
          <description>Registr inicializacii dannyh zaszitnoj setki 1 (bity 31:0)</description>
          <addressOffset>0x00000040</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>MESHCNTR</name>
          <displayName>MESHCNTR</displayName>
          <description>Registr upravlenija zaszitnoj setki</description>
          <addressOffset>0x00000044</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIV</name>
              <description>DIV description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
